// 球面メッシュの細かさを設定
SetFactory("OpenCASCADE");

// 球を定義
Sphere(1) = {1, 3.25, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(2) = {1, 1, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(3) = {1, -1.25, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(4) = {1, -3.5, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(5) = {1, 3.25, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(6) = {1, 1, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(7) = {1, -1.25, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(8) = {1, -3.5, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(9) = {1, 3.25, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(10) = {1, 1, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(11) = {1, -1.25, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(12) = {1, -3.5, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(13) = {1, 3.25, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(14) = {1, 1, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(15) = {1, -1.25, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(16) = {1, -3.5, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(17) = {-1.25, 3.25, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(18) = {-1.25, 1, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(19) = {-1.25, -1.25, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(20) = {-1.25, -3.5, 3.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(21) = {-1.25, 3.25, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(22) = {-1.25, 1, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(23) = {-1.25, -1.25, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(24) = {-1.25, -3.5, 1, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(25) = {-1.25, 3.25, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(26) = {-1.25, 1, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(27) = {-1.25, -1.25, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(28) = {-1.25, -3.5, -1.25, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(29) = {-1.25, 3.25, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(30) = {-1.25, 1, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(31) = {-1.25, -1.25, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Sphere(32) = {-1.25, -3.5, -3.5, 1, -Pi/2, Pi/2, 2*Pi};
Mesh 2;
Mesh.SurfaceFaces = 1;
ReverseMesh Surface {:};
